Tekla Open API Reference for Tekla Structures 2025
Operation.MoveAnalysisPartAreaEdge Method
 Moves the analysis part area edge by translation vector. Perpendicular offset is calculated from the translation vector.
 Namespace: Tekla.Structures.Analysis.Operations
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool MoveAnalysisPartAreaEdge(
	AnalysisPart analysisPart,
	AnalysisNode edgeNode1,
	AnalysisNode edgeNode2,
	Vector translation
)
Public Shared Function MoveAnalysisPartAreaEdge (
	analysisPart As AnalysisPart,
	edgeNode1 As AnalysisNode,
	edgeNode2 As AnalysisNode,
	translation As Vector
) As Boolean
Parameters
analysisPart
Type: Tekla.Structures.Analysis.AnalysisPart
The analysis part.
edgeNode1
Type: Tekla.Structures.Analysis.AnalysisNode
Edge node 1.
edgeNode2
Type: Tekla.Structures.Analysis.AnalysisNode
Edge node 2.
translation
Type: Tekla.Structures.Geometry3d.Vector
The vector for moving the edge.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
Operation Class
Tekla.Structures.Analysis.Operations Namespace